//********************************************************* 
/* 文件名：TEST_FT62F21x_PWM1.c
* 功能：   FT62F21x-PWM1功能演示
* IC:	   FT62F211 SOP8
* 晶振：   16M/4T                    
* 说明：   P1A0输出10kHz占空比50%的波形(实测9.8kHz)
*
 *                 FT62F211 SOP8 
 *               ----------------
 * NC-----------|1(PA4)    (PA3)8|----------P1A0    
 * NC-----------|2(TKCAP)  (PA0)7|------------NC
 * VDD----------|3(VDD)    (PA1)6|------------NC
 * GND----------|4(VSS)    (PA2)5|------------NC
*			     ----------------
*/
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT62F21X.h";
/*-------------------------------------------------
 * 函数名：中断处理程序
 * 功能：  定时器2中断
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)			
{ 
	if(TMR2IE && TMR2IF)			//100us中断一次 
	{
		TMR2IF = 0;
	} 
}
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110000;			//IRCF=111=16MHz/4T=4MHz,0.25us
	INTCON = 0;  					//暂禁止所有中断

	PORTA = 0B00000000;				
	TRISA = 0B00000000;				//PA输入输出 0-输出 1-输入  
	WPUA = 0B00000000;     			//PA端口上拉控制 1-开上拉 0-关上拉

	OPTION = 0B00001000;			//Bit3=1 WDT MODE,PS=000=1:1 WDT RATE
	MSCON = 0B00000000;		                             
}
/*-------------------------------------------------
 * 函数名：PWM1_INITIAL 
 * 功能：  PWM1初始化函数
 * 设置：  周期 =(PR2+1)*Tt2ck*TMR2预分频
 *		   	    =(99+1)*0.25*4=100us
 * 		   脉宽 = P1xDT*Tt2ck*TMR2预分频
 *				= 50*0.25*4=50us
 --------------------------------------------------*/
void PWM1_INITIAL(void)
{
	T2CON0=0B00000001;	//T2预分频1:4，后分频1:1
    //Bit7:  0：周期结束后正常更新； 1：把PR2/P1xDTy缓冲值分别更新到PR2寄存器和P1xDTy_ACT
    //Bit[6:3]: 后分频比选择 0000-1:1;0001-1:2;……1:16
    //Bit2:  0:关闭定时器2；1：打开定时器2
    //Bit[1:0]:定时器2预分频选择 00:1;01:4;1x:16
    
    T2CON1=0B00000000;	//T2时钟来自系统时钟，PWM连续模式
    //Bit4:    PWM模式选择 0:连续模式；1：单脉冲模式
    //Bit3:    0:PWM模式；1：蜂鸣器模式	
    //Bit[2:0]:Timer2时钟源选择
    //000：指令时钟；
    //001：系统时钟；
    //010：HIRC的2倍频；
    //100：HIRC；
    //101：LIRC
    
    TMR2H=0;						//定时器2计数寄存器
    TMR2L=0;
    
    PR2H=0;							//PR赋值
    PR2L=99;
    
    P1ADTH=0;						//P1ADT赋值
    P1ADTL=50;
    
    P1OE=0B00000001;				//P1A0输出使能
	//Bit7: 0:禁止P1C输出到管脚;1:允许P1C输出到管脚
    //Bit6: 0:禁止P1B输出到管脚;1:允许P1B输出到管脚
    //Bit5: 0:禁止P1D输出到管脚;1:允许P1D输出到管脚
    //Bit[3:2]: 故障下，[P1C]管脚的状态，只有当P1CALT为1时才有效 
    //00=高阻  
    //01=输出0  
    //1x=输出1
    //Bit1: 0:禁止P1A0N输出到管脚;1:允许P1A0N输出到管脚
    //Bit0: 0:禁止P1A0输出到管脚;1:允许P1A0输出到管脚    
 
	P1POL=0B00000000;				//P1A0高电平有效
    //Bit7: 0:P1C高电平有效;1:P1C低电平有效
    //Bit6: 0:P1B高电平有效;1:P1B低电平有效
    //Bit5: 0:P1D高电平有效;1:P1D低电平有效
    //Bit1: 0:P1A0N高电平有效;1:P1A0N低电平有效
    //Bit0: 0:P1A0高电平有效;1:P1A0低电平有效
    
    P1CON=0B00000000;
    //Bit7:PWM1 重启使能位
	//1 = 故障刹车时，P1BEVT位在退出关闭事件时自动清零，PWM1自动重启
	//0 = 故障刹车时，必须用软件将P1BEVT清零以重启PWM1
    //Bit[6:0]:PWM1死区时间设置
	//P1DCn = 预定MPWM信号应转变为有效与PWM信号实际转为有效之间的T2CK周期数
    
    TMR2IF=0;						//清TIMER2中断标志
    TMR2IE=1;						//使能TIMER2的中断
    TMR2ON=1;						//打开定时器2
    PEIE=1;							//使能外设中断
    GIE=1;							//使能全局中断
}
/*-------------------------------------------------
 * 函数名: main 
 * 功能：  主函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main()
{
	POWER_INITIAL();				//系统初始化
    PWM1_INITIAL();					//初始化PWM1
	while(1)
	{
		NOP();
	}
}
