#ifndef	_DELAY_H_
#define	_DELAY_H_
#include "syscfg.h"
//#include "FT62F02x.h"
 //******************************************** 
//函数名称：DelayUs
//功能：    短延时函数 --16M-2T--大概快1%左右.
//输入参数：Time  延时时间长度   延时时长TimeUs
//返回参数：无 
//********************************************
void DelayUs(unsigned char Time);
                
//******************************************** 
//函数名称：DelayMs
//功能：    短延时函数
//输入参数：Time  延时时间长度   延时时长Timems
//返回参数：无 
//********************************************
void DelayMs(unsigned char Time);
 
//******************************************** 
//函数名称：DelayS
//功能：    短延时函数
//输入参数：Time  延时时间长度   延时时长TimeS
//返回参数：无 
//********************************************
void DelayS(unsigned char Time);
 
#endif	