//********************************************************* 
/*  ÎÄ¼þÃû£ºmain.c    
*   IC:     FT62F211--------------------
*/
//*********************************************************
#include "Touch.h"
//**********************************************************
//***********************ºê¶¨Òå*****************************
#define  unchar   unsigned char 
#define  unint      unsigned int
#define  unlong   unsigned long


unsigned char GKeyValue;	
unsigned int StartTouchTime;//¿ªÊ¼É¨ÃèÊ±¼ä 
bit awaken;  

//**************ÖÐ¶Ï´¦Àí**********************************
void interrupt ISR(void)//PIC_HI-TECHÊ¹ÓÃ
{ 
    
	if(T0IE && T0IF)
    {
	    T0IF = 0;
 		TMR0 = 206;                       
        StartTouchTime++;     
    }   
} 
/*----------------------------------------------------
 *	º¯ÊýÃû³Æ£ºTIMER0_INITIAL
 *	¹¦ÄÜ£º³õÊ¼»¯ÉèÖÃ¶¨Ê±Æ÷
 *	Ïà¹Ø¼Ä´æÆ÷£ºT0CS T0SE PSA 
 *	ÉèÖÃTMR0¶¨Ê±Ê±³¤0.4MS=(1/16000000)*4*32*255(16M-4T-PSA 1:32- TMR0=255Òç³ö)	                      
 ----------------------------------------------------*/
void TIMER0_INITIAL (void)  
{
    TMR0 = 206;           //8us*(255-120)=1MS          
    T0IF = 0;				//Çå¿ÕT0Èí¼þÖÐ¶Ï
    T0IE = 1;				//¿ª¶¨Ê±Æ÷/¼ÆÊýÆ÷0ÖÐ¶Ï
    GIE = 1;
}

/*-------------------------------------------------
 *  º¯ÊýÃû£ºSYS_INITIAL
 *	¹¦ÄÜ£º  ÉÏµçÏµÍ³³õÊ¼»¯
 *  ÊäÈë£º  ÎÞ
 *  Êä³ö£º  ÎÞ
 --------------------------------------------------*/	
void SYS_INITIAL (void) //Ê±ÖÓÏÈ8M Ð´ÍêPCON (bit7),OPTION(all bit),LVDCON(bit2),ºó»»»Ø16M
{
	 
	OSCCON = 0B01100000;//WDT 32KHZ IRCF=110=8MHZ/4=4MHZ,0.25US/T
											//Bit0=1,ÏµÍ³Ê±ÖÓÎªÄÚ²¿Õñµ´Æ÷
											//Bit0=0,Ê±ÖÓÔ´ÓÉFOSC<2£º0>¾ö¶¨¼´±àÒëÑ¡ÏîÊ±Ñ¡Ôñ
	OPTION = 0B00000100;	//Bit5 T0CS Timer0Ê±ÖÓÔ´Ñ¡Ôñ 
							//1-Íâ²¿Òý½ÅµçÆ½±ä»¯T0CKI 0-ÄÚ²¿Ê±ÖÓ(FOSC/2)
							//Bit4 T0CKIÒý½Å´¥·¢·½Ê½ 1-ÏÂ½µÑØ 0-ÉÏÉýÑØ
							//Bit3 PSA Ô¤·ÖÆµÆ÷·ÖÅäÎ» 0-Timer0 1-WDT 
							//Bit2:0 PS2 8¸öÔ¤·ÖÆµ±È 100 - 1:32
                            
    LVDCON  = 0x03;   	//bit2 0:²»¾­¹ýÈ¥¶¶µçÂ·  bit[1:0] 00:vdd 01:pa5 10:pa4 11:touch
    PCON	= 0x88;		//¿ªLVD  bit3 µÍµçÑ¹Õì²âÊ¹ÄÜ   bit[7:4]=1xxx 1.2v

	OSCCON = 0B01110000;//WDT 32KHZ IRCF=110=16MHZ/4=4MHZ,0.25US/Tñ
	INTCON = 0;  					//ÔÝ½ûÖ¹ËùÓÐÖÐ¶Ï
	PORTA = 0;
	TRISA =  0B00001111;		// 0-Êä³ö 1-ÊäÈë  
	WPUA =  0B00000000;     	//PA¶Ë¿ÚÉÏÀ­¿ØÖÆ 1-¿ªÉÏÀ­ 0-¹ØÉÏÀ­
    PSRCA = 0B00000000;        //PA4,PA5Ô´µçÁ÷ÄÜÁ¦ÉèÖÃÎª0								   
}
/*------------------------------------------------------------------------------------------
 *  º¯ÊýÃû:  main 
 *	¹¦ÄÜ£º  Ö÷º¯Êý
 *  ÊäÈë£º  ÎÞ
 *  Êä³ö£º  ÎÞ
 ----------------------------------------------------------------------------------------------*/
void main()
{
	SYS_INITIAL();				//ÏµÍ³³õÊ¼»¯
    TIMER0_INITIAL();  		//³õÊ¼»¯T0
	Touch_init();
	while(1)
	{
        CLRWDT();       		 
//----------------------------------------------------------------------------------
		if(StartTouchTime >= (2500/SCANNINGTIME/TouchCount))//É¨ÃèÊ±¼ä ¸ù¾ÝÉ¨ÃèÖÜÆÚ¼°°´¼ü¸öÊý¼ÆËã.
        {
			StartTouchTime = 0;	
			GKeyValue = TouchKeyScan(); //°´¼üÉ¨Ãè²¢»ñÈ¡°´¼üÖµ	
	 
        }       
    }
                    
}


