//********************************************************* 
/* 文件名: Test_62F21X_MSCK.c
* 功能：   FT62F21X_MSCK功能演示
* IC:      FT62F211 SOP8 
* 晶振：   16M/4T                    
* 说明：   慢时钟测量结果存储在相关寄存器中，程序读取出
*
*                  	 FT62F211 SOP8 
*                  ----------------
*  NC------------|1(PA4)     (PA3)8|-------------NC 
*  NC------------|2(TKCAP)   (PA0)7|-------------NC
*  NC------------|3(VDD)	 (PA1)6|-------------NC 
*  NC------------|4(VSS) 	 (PA2)5|-------------NC
*			       ----------------
*/
//********************************************************* 
#include	"SYSCFG.h";
#include 	"FT62F21X.h";
unsigned 	int		temp;
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = 0B01110000;	//16MHz 1:1
	INTCON = 0;  			//暂禁止所有中断
	OPTION = 0B00000000;
    TRISA = 0B00000000;		//PA输入输出 1:输入 0:输出	
    PSRCA = 0B00000000;
    //00:	3mA
    //01/10:6mA
    //11:	24mA
    //bit[3:2]:控制PA5源电流
    //bit[1:0]:控制PA4源电流
    
    PSINKA = 0B00000000;	//Bit[1:0]:控制PA5和PA4 0:灌电流最小 1:灌电流最大
    PORTA = 0B00000000;		//1:PAx输出高电平	0:PAx输出低电平	
 	WPUA = 0B00000000;		//1:使能PA口上拉	0:关闭PA口上拉   
}

void MSCK_Init(void)
{
    TMR2ON = 1;				//打开Timer2
	CKMAVG = 0;				//打开/关闭4次平均	0:关闭	1:打开
}
/*-------------------------------------------------
 * 函数名：main 
 * 功能：  主函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main()
{
    POWER_INITIAL();	//系统初始化
	MSCK_Init();		//慢时钟测量初始化
    
	CKCNTI = 1;			//开始测量
	while(1)
    {
        if(CKMIF)		//慢时钟测量完成中断标志位  查询方式
		{
            temp = (SOSCPRH &0x0f)<<8;
            temp |= SOSCPRL;
            CKMIF = 0;
		}
		NOP();
	}
}